{
  "challenges": [
    {
      "name": "What is Coding",
      "section": "introcoding",
      "number": 1,
      "description": "Coding otherwise known as programming is an idea about telling a computer what to do. Everything that you see on your screen whether that is your phone or your computer has computer code running beneath it which tells the computer what to do. There are a lot of different types of programming like embedded programming which works on things like the operating system, or web development which works on things like websites, similar to this one.",
      "tests": [
        {
          "text": "set value to 20",
          "test": "assert()"
        }
      ],
      "definitions": [
        "Supervised Learning,1",
        "Linear Regression,0"
      ],
      "codeblocks": false,
      "hints": [

      ]
    }, 
    {
      "name": "Add a Variable",
      "section": "introcoding",
      "number": 2,
      "description": "In computer programming, variables are used to store information to be referenced later. For example you can use the variable block and make a variable <code>x</code> and set it too 3.",
      "tests": [
        {
          "text": "add a variable x and set it too 3",
          "test": "assert(code[0], 'x'); assert(code[1], 3); assert(code[2], 'variablefunction');"
        }
      ],
      "definitions": [
        "Supervised Learning,1",
        "Linear Regression,0"
      ],
      "codeblocks": true,
      "hints": [
        "First try adding a <block>variable<block> block set it to <code>x</code>",
        "Make sure that you set the variable to <code>3</code>"
      ]
    }, 
    {
      "name": "Print variable",
      "section": "introcoding",
      "number": 3, 
      "description": "Another part of programming is printing our output. Below, there is a console which can be used to print text, or things such as the variable. Use the print function and print <code>x</code>, and you will then see the output in the console.",
      "tests": [
        {
          "text": "print a string",
          "test": "assert(code[1], 'printfunction'); lengthfunc(code[0], 0)"
        }
      ],
      "definitions": [
        "Supervised Learning,1",
        "Linear Regression,0"
      ],
      "codeblocks": true
    },
    {
      "name": "Functions",
      "section": "introcoding",
      "number": 4, 
      "description": "Functions are another big part of programming, it can be thought of a block of code that can be called. This makes the code reusable as you can call it more than once as well as keep code separated and better. Make a function using the function block and call it <code>z</code> and inside it, make a variable y and set it to some text. Then print the variable inside of the function. THIS CAN BE SPLIT INTO SEPERATE SECTIONS FOR USABILITY",
      "tests": [
        {
          "text": "make a function put a variable and print it",
          "test": "assert() //RIGHT SOME TESTS FOR THIS THING"
        }
      ],
      "definitions": [
        "Supervised Learning,1",
        "Linear Regression,0"
      ],
      "codeblocks": true
    },
    {
      "name": "Call the function",
      "section": "introcoding",
      "number": 5, 
      "description": "The beauty of a function is how you can call it whenever you want. You can call function z now. Try calling it and see the print function return a value. // TRY TO GET CODE FROM PREVIOUS CHALLENGE FOR THIS ONE",
      "tests": [
        {
          "text": "call the function z",
          "test": "assert(code[2], 'callfunctionblock'); assert(code[0], 'z')"
        }
      ], 
      "codeblocks": true 
    }, 
    {
      "name": "Add arguments to function",
      "section": "introcoding",
      "number": 6, 
      "description": "You can add arguments to functions, when you call the function next to the name you can add variables that you can then use in your code and assign it to a value when you call the function. Add an argument next to the function name, use it when you call print inside the function. // GET PREVIOUS CODE FROM LAST CHALLENGES",
      "tests": [
        {
      
        }
      ],
      "codeblocks": true
    },
    {
      "name": "Use the argument",
      "number": 7,
      "description": "Now when you call the function next to the name that you want to call you can also add any text that you want and that would be passed down to the function as an argument. You can set it to whatever text you want and our function would print it. Call the function and type up whatever text you want to add. ",
      "tests": [
        {
          "text": "call the function z",
          "test": "assert(code[2], 'callfunctionblock'); assert(code[0], 'z'); doesnotequal(code[1], 'arguments'); lengthfunc(code[1], 0);"
        }
      ],
      "codeblocks": true
    },
    {
      "name": "If statements",
      "number": 8,
      "description": "Similar to a yes or no question, an <code>if</code> statement has a instruction say it can check if a variable is equal to text. If that is true, a block of code would get executed and if it is false nothing would be executed. Try making an if statement and printing a number to the console.",
      "tests": [
        {
          "test": ""
        }
      ], 
      "codeblocks": true
    },
    {
      "name": "Else Statements",
      "number": 9, 
      "description": "If the if statement returns false, then you can also execute whatever code you want with an <code>else</code> statement. Add it to the end of an if statement and return text. Now, if the condition returns false, that text would get returned in the console.",
      "codeblocks": false
    }
  ] 
}