{
  "definitions": [
    {
      "name": "Linear Regression",
      "definition": "Linear regression plots a line through numerical data points, that way you can plot a line through all the data points to get the average. For example, you can create an algorithm that predicts the price of a house and you can plot a line through that data using linear regression. With that average line bringing together the square feet and the price of a house we can input any square feet value and with that line that we the computer created we can get an approximate prediction of the price of the house based on our set of data."
    },
    {
      "name": "Supervised Learning",
      "definition": "In supervised Learning, both input and output data is provided. Inputs and output data are labelled for classification."
    },
    {
      "name": "Computer Programming",
      "definition": "Coding otherwise known as programming is an idea about telling a computer what to do. Everything that you see on your screen whether that is your phone or your computer has computer code running beneath it which tells the computer what to do. There are a lot of different types of programming such as embedded programming which focuses on things like the operating system, or web development which works on things such as websites, just like this one. Or things like machine learning which programming can be used for."
    },
    {
      "name": "Variables",
      "definition": "In computer programming, variables are used to store information that can be later referenced. You can make  a variable set it to a string or number and then after you can call it whenever you want in your code."
    },
    {
      "name": "Print Function",
      "definition": "A print function in computer programming can print a variable, text, etc to the console to return a value. It is a good way to see how your program is running to check things like accuracy of your machine learning model. "
    },
    {
      "name": "Functions",
      "definition": "A function is a section of a program that preforms a specific task. It can be a procedure or routine that can be called. The code can be reusable. This means, if you make a function that prints some text, you can call that function whenever you want in your code and it will run the function printing the variable."
    },
    {
      "name": "Machine Learning",
      "definition": "Machine Learning is an application of artificial intelligence that teaches a computer things through data that is fed into an algorithm. The computer can then learn by itself rather than having to be programmed to learn specific things. For example, you can use an algorithm and feed the computer images of licenses plates so it learns about them, or you can program it. If you program it you need to mention specific things such as: the colour of the license plate, the shape, the letters, etc."
    },
    {
      "name": "Unsupervised Learning",
      "definition": "Unsupervised Learning is a type of machine learning that uses algorithms but the data is not labeled. It can group and cluster data based on patterns and similarities with each data point."
    },
    {
      "name": "Reinforcement Learning",
      "definition": "Reinforcement Learning is a type of Machine Learning that an algorithm learns by interacting with an environment. This is refered to as an agent."
    }, 
    {
      "name": "Classification",
      "definition": "Classification is when an algorithm seperates data points into groups based on their characteristics."
    },
    {
      "name": "Support Vector Machine",
      "definition": "Support vector machines work by plotting a line between data points. It plots this line by plotting 3 seperate lines each one going to a data point. The distance between these points and the main line is called the margin. Maximizing the distance between the nearest datapoint on either class will help us get the right line."
    }
  ]
}