{
  "definitions": [
    {
      "name": "Linear Regression",
      "definition": "Linear regression is when we do some awesome stuff to predict house prices <img src='https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Linear_regression.svg/438px-Linear_regression.svg.png'></img>"
    },
    {
      "name": "Supervised Learning",
      "definition": "Supervised learning is dope"
    },
    {
      "name": "Computer Programming",
      "definition": "Coding otherwise known as programming is an idea about telling a computer what to do. Everything that you see on your screen whether that is your phone or your computer has computer code running beneath it which tells the computer what to do. There are a lot of different types of programming such as embedded programming which focuses on things like the operating system, or web development which works on things such as websites, just like this one. Or things like machine learning which programming can be used for."
    },
    {
      "name": "Variables",
      "definition": "In computer programming, variables are used to store information that can be later referenced. You can make  a variable set it to a string or number and then after you can call it whenever you want in your code."
    },
    {
      "name": "Print Function",
      "definition": "A print function in computer programming can print a variable, text, etc to the console to return a value. It is a good way to see how your program is running to check things like accuracy of your machine learning model. "
    },
    {
      "name": "Functions",
      "definition": "A function is a section of a program that preforms a specific task. It can be a procedure or routine that can be called. The code can be reusable. This means, if you make a function that prints some text, you can call that function whenever you want in your code and it will run the function printing the variable."
    },
    {
      "name": "Machine Learning",
      "definition": "Machine learning stuff"
    },
    {
      "name": "Unsupervised Learning",
      "definition": "Unsupervised Learning stuff"
    },
    {
      "name": "Reinforcement Learning",
      "definition": "Reinforcement Learning stuff"
    }, 
    {
      "name": "Classification",
      "definition": "Classifaction dopeness"
    },
    {
      "name": "Support Vector Machine",
      "definition": "Support Vector Machines"
    }
  ]
}